[
  {
    "id": "1",
    "title": "Introduction to JavaScript",
    "details": "JavaScript is a high-level, interpreted programming language. It is a versatile and widely-used language in web development. With its asynchronous capabilities, JavaScript allows for dynamic and interactive user interfaces.",
    "tags": ["javascript", "programming", "Basic"],
    "slug": "introduction-to-javascript",
    "children": [
      {
        "id": "1.1",
        "title": "JavaScript Basics",
        "details": "In this section, we cover the fundamental concepts of JavaScript. Topics include variables, data types, control flow, and basic functions.",
        "tags": ["javascript", "programming", "Basic"],
        "slug": "javascript-basics"
      },
      {
        "id": "1.2",
        "title": "Asynchronous JavaScript",
        "details": "Learn about asynchronous programming in JavaScript. Explore concepts such as callbacks, promises, and async/await for managing asynchronous operations.",
        "tags": ["javascript", "programming", "Asynchronous"],
        "slug": "asynchronous-javascript"
      }
    ]
  },
  {
    "id": "2",
    "title": "Object-Oriented Programming in Java",
    "details": "Java is an object-oriented programming language known for its platform independence. It follows the principles of encapsulation, inheritance, and polymorphism.",
    "tags": ["java", "programming", "OOP"],
    "slug": "oop-in-java"
  },
  {
    "id": "3",
    "title": "HTML5 and CSS3 Fundamentals",
    "details": "HTML5 and CSS3 are core technologies for building modern, responsive web pages. HTML5 introduces new semantic elements, while CSS3 provides powerful styling capabilities.",
    "tags": ["html5", "css3", "web", "Basic"],
    "slug": "html5-css3-fundamentals"
  },
  {
    "id": "4",
    "title": "Python for Data Science",
    "details": "Python is a popular language for data science. It offers libraries like NumPy, Pandas, and Matplotlib for efficient data manipulation, analysis, and visualization.",
    "tags": ["python", "data science", "Basic"],
    "slug": "python-for-data-science"
  },
  {
    "id": "5",
    "title": "Responsive Web Design with Bootstrap",
    "details": "Bootstrap is a front-end framework for building responsive and mobile-first web pages. It provides a grid system, components, and utilities for faster development.",
    "tags": ["bootstrap", "web design", "Basic"],
    "slug": "responsive-web-design"
  },
  {
    "id": "6",
    "title": "Introduction to React.js",
    "details": "React.js is a JavaScript library for building user interfaces. It allows for the creation of reusable UI components and provides a virtual DOM for efficient rendering.",
    "tags": ["react.js", "javascript", "Basic"],
    "slug": "introduction-to-react",
    "children": [
      {
        "id": "6.1",
        "title": "React Components",
        "details": "Understanding the component-based architecture in React. Components are the building blocks of a React application, encapsulating both structure and behavior.",
        "tags": ["react.js", "javascript", "Basic"],
        "slug": "react-components"
      },
      {
        "id": "6.2",
        "title": "State and Props",
        "details": "Explore the concepts of state and props in React. These mechanisms enable dynamic and interactive user interfaces by managing component data.",
        "tags": ["react.js", "javascript", "Basic"],
        "slug": "state-and-props"
      }
    ]
  },
  {
    "id": "7",
    "title": "Node.js and Express.js",
    "details": "Node.js is a runtime for executing JavaScript on the server. Express.js is a web application framework for building robust and scalable server-side applications.",
    "tags": ["node.js", "express.js", "web development"],
    "slug": "node-express"
  },
  {
    "id": "8",
    "title": "Databases with MongoDB",
    "details": "MongoDB is a NoSQL database that stores data in flexible, JSON-like documents. It is suitable for handling large amounts of unstructured data.",
    "tags": ["mongodb", "database", "NoSQL"],
    "slug": "mongodb-databases"
  },
  {
    "id": "9",
    "title": "Introduction to Angular",
    "details": "Angular is a front-end web framework developed by Google. It is built with TypeScript and supports the development of single-page applications with a modular architecture.",
    "tags": ["angular", "Basic"],
    "slug": "introduction-to-angular",
    "children": [
      {
        "id": "9.1",
        "title": "Angular Components",
        "details": "Learn about building components in Angular. Components are the basic building blocks of an Angular application, each encapsulating a specific functionality.",
        "tags": ["angular", "Basic"],
        "slug": "angular-components"
      },
      {
        "id": "9.2",
        "title": "Angular Services",
        "details": "Explore the use of services in Angular. Services are reusable and injectable objects that provide shared functionality throughout an Angular application.",
        "tags": ["angular", "Basic"],
        "slug": "angular-services"
      }
    ]
  },
  {
    "id": "10",
    "title": "Swift Programming for iOS",
    "details": "Swift is a powerful and intuitive programming language for iOS, macOS, watchOS, and tvOS development. It is designed to be fast and expressive.",
    "tags": ["swift", "iOS", "programming"],
    "slug": "swift-programming-for-ios"
  },
  {
    "id": "11",
    "title": "Introduction to Machine Learning",
    "details": "Machine Learning is a field of artificial intelligence that focuses on building systems that can learn from and make predictions based on data. It includes supervised and unsupervised learning.",
    "tags": ["machine learning", "data science"],
    "slug": "introduction-to-machine-learning"
  },
  {
    "id": "12",
    "title": "Cybersecurity Fundamentals",
    "details": "Cybersecurity involves the practice of protecting systems, networks, and programs from digital attacks. It includes measures to prevent, detect, and respond to security incidents.",
    "tags": ["cybersecurity", "security"],
    "slug": "cybersecurity-fundamentals"
  },
  {
    "id": "13",
    "title": "RESTful API Design with Flask",
    "details": "Flask is a lightweight web framework for Python. This section covers the design principles of RESTful APIs using Flask, focusing on resource-based architecture and HTTP methods.",
    "tags": ["flask", "api", "web development"],
    "slug": "restful-api-design"
  },
  {
    "id": "14",
    "title": "Data Structures in C++",
    "details": "C++ is a powerful programming language known for its performance and versatility. This section explores various data structures, including arrays, linked lists, and trees, implemented in C++.",
    "tags": ["c++", "programming", "data structures"],
    "slug": "data-structures-c++"
  },
  {
    "id": "15",
    "title": "Introduction to Vue.js",
    "details": "Vue.js is a progressive JavaScript framework for building user interfaces. It is designed to be incrementally adoptable, making it easy to integrate with existing projects.",
    "tags": ["vue.js", "javascript", "web development"],
    "slug": "introduction-to-vue",
    "children": [
      {
        "id": "15.1",
        "title": "Vue Components",
        "details": "Understanding the component-based architecture in Vue.js. Components in Vue.js are reusable and self-contained units that can be composed to build complex user interfaces.",
        "tags": ["vue.js", "javascript", "web development"],
        "slug": "vue-components"
      },
      {
        "id": "15.2",
        "title": "Vue Router and State Management",
        "details": "Explore Vue Router for navigation and Vuex for state management. These Vue.js features enable the creation of powerful and dynamic single-page applications.",
        "tags": ["vue.js", "javascript", "web development"],
        "slug": "vue-router-state-management"
      }
    ]
  },
  {
    "id": "16",
    "title": "Network Security Essentials",
    "details": "Network security is a critical aspect of IT infrastructure. This section covers essential concepts such as firewalls, encryption, and intrusion detection systems to protect networks from cyber threats.",
    "tags": ["network security", "security"],
    "slug": "network-security-essentials"
  },
  {
    "id": "17",
    "title": "Android App Development with Kotlin",
    "details": "Kotlin is a modern programming language that is officially supported for Android development. This section introduces the basics of Android app development using Kotlin.",
    "tags": ["android", "kotlin", "mobile development"],
    "slug": "android-app-development"
  },
  {
    "id": "18",
    "title": "Advanced JavaScript Techniques",
    "details": "Explore advanced techniques in JavaScript programming. Topics include closures, prototypal inheritance, and design patterns for building scalable and maintainable code.",
    "tags": ["javascript", "programming", "advanced"],
    "slug": "advanced-javascript-techniques"
  },
  {
    "id": "19",
    "title": "Database Administration with SQL Server",
    "details": "SQL Server is a relational database management system by Microsoft. This section covers database administration tasks, including backup and restore, performance tuning, and security.",
    "tags": ["sql server", "database", "administration"],
    "slug": "database-administration-sql-server"
  },
  {
    "id": "20",
    "title": "Introduction to DevOps",
    "details": "DevOps is a set of practices that aim to automate and streamline the processes between software development and IT operations. This section introduces key DevOps principles and tools.",
    "tags": ["devops", "software development"],
    "slug": "introduction-to-devops"
  },
  {
    "id": "21",
    "title": "Python Web Development with Django",
    "details": "Django is a high-level Python web framework that encourages rapid development and clean, pragmatic design. This section covers building web applications using Django.",
    "tags": ["python", "django", "web development"],
    "slug": "python-web-development-django"
  },
  {
    "id": "22",
    "title": "Game Development with Unity",
    "details": "Unity is a powerful game development engine used to create 2D and 3D games. This section explores the basics of Unity game development and the creation of interactive experiences.",
    "tags": ["unity", "game development"],
    "slug": "game-development-unity",
    "children": [
      {
        "id": "22.1",
        "title": "Unity Scripting",
        "details": "Learn scripting in Unity using C#. This scripting language is essential for creating interactive gameplay mechanics and controlling game objects in Unity.",
        "tags": ["unity", "game development", "C#"],
        "slug": "unity-scripting"
      },
      {
        "id": "22.2",
        "title": "Unity Physics and Animation",
        "details": "Explore Unity's physics engine and animation system. Understand how to create realistic movements, collisions, and animations for game characters and objects.",
        "tags": ["unity", "game development"],
        "slug": "unity-physics-animation"
      }
    ]
  },
  {
    "id": "23",
    "title": "Introduction to Cloud Computing",
    "details": "Cloud computing provides on-demand access to a shared pool of computing resources over the internet. This section introduces the fundamental concepts and services offered by cloud providers.",
    "tags": ["cloud computing", "technology"],
    "slug": "introduction-to-cloud-computing"
  },
  {
    "id": "24",
    "title": "Frontend Development with Angular",
    "details": "Angular is a powerful front-end framework for building dynamic and single-page web applications. This section covers advanced topics in Angular development.",
    "tags": ["angular", "web development"],
    "slug": "frontend-development-angular",
    "children": [
      {
        "id": "24.1",
        "title": "Angular Directives",
        "details": "Understand Angular directives for extending HTML with custom behavior. Directives are a powerful feature for creating reusable and modular components in Angular.",
        "tags": ["angular", "web development"],
        "slug": "angular-directives"
      },
      {
        "id": "24.2",
        "title": "Angular Forms and Validation",
        "details": "Explore Angular forms and validation techniques. Effectively handle user input, perform form validation, and create responsive and interactive forms in Angular.",
        "tags": ["angular", "web development"],
        "slug": "angular-forms-validation"
      }
    ]
  },
  {
    "id": "25",
    "title": "Java Spring Framework",
    "details": "Spring is a comprehensive framework for Java development. This section covers the Spring framework, including features like dependency injection, MVC, and data access.",
    "tags": ["java", "spring", "web development"],
    "slug": "java-spring-framework"
  },
  {
    "id": "26",
    "title": "Mobile App Design Principles",
    "details": "Designing mobile applications requires attention to user experience and interface. This section explores key design principles for creating visually appealing and user-friendly mobile apps.",
    "tags": ["design", "mobile app", "UX"],
    "slug": "mobile-app-design-principles"
  }
]
